webshopnew/app/views/users/show.html.erb

    <%# Usar una única llamada para renderizar la lista, no usar la iteración %>
    <% @user.reviews.each do |review|%>
---
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`user_id` = 2