webshopnew/app/controllers/users_controller.rb

INSERT INTO `users` (`created_at`, `email`, `first_name`, `last_name`, `password_digest`, `updated_at`) VALUES ('2012-08-23 19:42:46', 'Ve', 'Manuel', 'Ma', '$2a$10$bxGWaDcpvXPGiYjVAj0A7.h54RNtFOirxVxxw/FMyAWtPf2SzbrG2', '2012-08-23 19:42:46')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
UPDATE `users` SET `updated_at` = '2012-08-23 19:44:17', `last_name` = 'Martín', `email` = 'Veragua' WHERE `users`.`id` = 3
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])